'''
3. Представлен список чисел. Определить элементы списка, не имеющие повторений.
    Сформировать итоговый массив чисел, соответствующих требованию.
    Элементы вывести в порядке их следования в исходном списке.
    Для выполнения задания обязательно использовать генератор.
    Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
    Результат: [23, 1, 3, 10, 4, 11]
'''

if __name__ == "__main__":
    origin_list = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
    print(f'Исходный список - {origin_list}')

    # *********************************************************************
    # Вариант ленивый. Сложность O(N^2)
    # *********************************************************************
    unique_list = [
        itm for itm in origin_list
        if origin_list.count(itm) == 1
    ]
    print(f'Список неповторяющихся значений - {unique_list}')

    # *********************************************************************
    # Вариант спорный. Сложность O(2*N). Дополнительная память O(N)
    # *********************************************************************
    check_dic = {}
    for itm in origin_list:
        check_dic[itm] = check_dic.get(itm, 0) + 1

    unique_list = [
        key for key, val in check_dic.items()
        if val < 2
    ]
    print(f'Список неповторяющихся значений - {unique_list}')
